zenes/esp32s3-TAS/examples/tas/tas.ino
#ifdef USE_LOVYANGFX
LGFX tft;
#else
TFT_eSPI tft = TFT_eSPI(); // Invoke custom library
#endif
#define ENABLE_LCD


static bool lcd_initialized = false;
static bool lcd_detected = false;

#ifdef ENABLE_TOUCH
/* Touch Instance */
#ifdef LCD_TYPE_ILI9341
XPT2046_Touchscreen tp(TOUCH_CS, TOUCH_IRQ);
#elif defined(TOUCH_SDA) && defined(TOUCH_SCL)
TAMC_GT911 tp = TAMC_GT911(TOUCH_SDA, TOUCH_SCL, TOUCH_INT, TOUCH_RST, TFT_WIDTH, TFT_HEIGHT);
#endif
static lv_obj_t * touch_cursor;
static lv_obj_t * touch_label;
static lv_obj_t * touch_line_h;
static lv_obj_t * touch_line_v;
#endif

/* LVGL Touchpad Read Callback */
void my_touchpad_read(lv_indev_drv_t * indev_drv, lv_indev_data_t * data) {
#ifdef ENABLE_TOUCH
#if defined(LCD_TYPE_ILI9341) || (defined(TOUCH_SDA) && defined(TOUCH_SCL))
    bool touched = false;
    int x = 0, y = 0;

    #ifdef LCD_TYPE_ILI9341
    if (tp.touched()) {
        TS_Point p = tp.getPoint();
        x = map(p.x, 200, 3700, 0, TFT_WIDTH);
        y = map(p.y, 240, 3800, 0, TFT_HEIGHT);
        touched = true;
    }
    #elif defined(TOUCH_SDA) && defined(TOUCH_SCL)
    tp.read();
    if (tp.isTouched) {
        // Calibration mapping: 
        // X: 0 ~ 300 -> 0 ~ 319
        // Y: 85 ~ 315 -> 0 ~ 239
        int raw_x = tp.points[0].x;
        int raw_y = tp.points[0].y;
        x = map(raw_x, 0, 300, 0, 319);
        y = map(raw_y, 85, 315, 0, 239);
        touched = true;
    }
    #endif

    if (touched) {
        data->state = LV_INDEV_STATE_PR;
        data->point.x = x;
        data->point.y = y;
        
        // Constrain to screen bounds
        if (data->point.x < 0) data->point.x = 0;
        if (data->point.x >= TFT_WIDTH) data->point.x = TFT_WIDTH - 1;
        if (data->point.y < 0) data->point.y = 0;
        if (data->point.y >= TFT_HEIGHT) data->point.y = TFT_HEIGHT - 1;

        if (touch_cursor) {
            lv_obj_set_pos(touch_cursor, data->point.x - 5, data->point.y - 5);
            lv_obj_clear_flag(touch_cursor, LV_OBJ_FLAG_HIDDEN);
            lv_obj_set_pos(touch_line_h, 0, data->point.y);
            lv_obj_clear_flag(touch_line_h, LV_OBJ_FLAG_HIDDEN);
            lv_obj_set_pos(touch_line_v, data->point.x, 0);
            lv_obj_clear_flag(touch_line_v, LV_OBJ_FLAG_HIDDEN);
            lv_label_set_text_fmt(touch_label, "X:%d Y:%d", data->point.x, data->point.y);
            lv_obj_set_pos(touch_label, data->point.x + 15, data->point.y + 15);
            lv_obj_clear_flag(touch_label, LV_OBJ_FLAG_HIDDEN);
        }
    } else {
        data->state = LV_INDEV_STATE_REL;
        if (touch_cursor) {
            lv_obj_add_flag(touch_cursor, LV_OBJ_FLAG_HIDDEN);
            lv_obj_add_flag(touch_line_h, LV_OBJ_FLAG_HIDDEN);
            lv_obj_add_flag(touch_line_v, LV_OBJ_FLAG_HIDDEN);
            lv_obj_add_flag(touch_label, LV_OBJ_FLAG_HIDDEN);
        }
    }
#else
    data->state = LV_INDEV_STATE_REL;
#endif
#else
    data->state = LV_INDEV_STATE_REL;
#endif
}

/* LVGL Double Buffers (Internal SRAM with DMA) */
static lv_disp_draw_buf_t draw_buf;
static lv_color_t *buf1 = NULL; 
static lv_color_t *buf2 = NULL; 

/* UI Objects */
static lv_obj_t *ui_label_eth;
static lv_obj_t *ui_label_ap;
static lv_obj_t *ui_label_clients;
static lv_obj_t *ui_label_fps;
#ifdef ENABLE_TE_SYNC
static lv_obj_t *ui_label_te;
#endif
static lv_obj_t *ui_debug_panel;
static lv_obj_t *ui_label_spi;
static lv_obj_t *ui_label_tgt_fps;
static lv_obj_t *ui_test_rect;
static uint32_t frame_cnt = 0;
static uint32_t fps_val = 0;

#ifdef ENABLE_GRADIENT_BG
/* Timer callback for Full Screen UI changes (Gradient/Color shift logic) */
void move_test_rect_cb(lv_timer_t * t) {
  static uint8_t c = 0;
  c += 2; // Slower, smoother change
  lv_obj_t *scr = lv_scr_act();
  if (!scr) return;
  lv_obj_set_style_bg_color(scr, lv_color_make(c, 100, 200), 0);
  lv_obj_set_style_bg_grad_color(scr, lv_color_make(200 - c, 50, 150), 0);
  lv_obj_set_style_bg_grad_dir(scr, LV_GRAD_DIR_VER, 0);
  
  if (ui_test_rect) {
      static int x_dir = 2, y_dir = 2;
      int cur_x = lv_obj_get_x(ui_test_rect);
      int cur_y = lv_obj_get_y(ui_test_rect);
      if (cur_x <= 0 || cur_x >= TFT_HEIGHT - 15) x_dir *= -1;
      if (cur_y <= 0 || cur_y >= TFT_WIDTH - 15) y_dir *= -1;
      lv_obj_set_pos(ui_test_rect, cur_x + x_dir, cur_y + y_dir);
  }
}
#endif

#ifdef ENABLE_TE_SYNC
#define TE_PIN 21
static SemaphoreHandle_t te_semaphore = NULL;

// TE 핀 주파수 측정용 변수 (명령어 사이사이 안전한 읽기를 위해 64비트 타이머 사용)
volatile int64_t last_te_time_us = 0;
volatile int64_t te_delta_us = 0;

void IRAM_ATTR te_isr_handler() {
    int64_t now_us = esp_timer_get_time();
    if (last_te_time_us > 0) {
        te_delta_us = now_us - last_te_time_us;
    }
    last_te_time_us = now_us;

    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    if (te_semaphore != NULL) {
        xSemaphoreGiveFromISR(te_semaphore, &xHigherPriorityTaskWoken);
        if (xHigherPriorityTaskWoken) {
            portYIELD_FROM_ISR();
        }
    }
}
#endif

/* Display flushing callback (Asynchronous DMA) */
void my_disp_flush(lv_disp_drv_t *disp, const lv_area_t *area, lv_color_t *color_p) {
  uint32_t w = (area->x2 - area->x1 + 1);
  uint32_t h = (area->y2 - area->y1 + 1);
  static bool transfer_open = false;

#ifdef USE_LOVYANGFX
  // 1. Wait for PREVIOUS DMA transfer to finish
  if (transfer_open) {
    tft.waitDMA();
    tft.endWrite();
  }

  // 2. Start new transfer session
  tft.startWrite();
  
#ifdef ENABLE_TE_SYNC
  // 3. V-Sync(TE) 동기화 복구 (첫 번째 조각 전송 전에만 스캐너 대기)
  static bool wait_for_te = true;
  if (wait_for_te && te_semaphore != NULL) {
      xSemaphoreTake(te_semaphore, pdMS_TO_TICKS(100)); // TE 신호 한 사이클 대기
  }
  wait_for_te = lv_disp_flush_is_last(disp); // 마지막 조각을 보낼 때 다음 프레임을 위해 대기 락 설정
#endif

  // 4. Start non-blocking DMA transfer
  tft.pushImageDMA(area->x1, area->y1, w, h, (uint16_t *)&color_p->full);
  
  transfer_open = true;
  frame_cnt++;
  lv_disp_flush_ready(disp);
#else
  // 1. Wait for PREVIOUS DMA transfer to finish, then close the SPI transaction
  if (transfer_open) {
    if (tft.dmaBusy()) {
      //delay(1); or yield();
      tft.dmaWait();
    }
    tft.endWrite(); // Resets CS pin HIGH (SPI Sync reset)
  }

  // 2. Start new transfer session (CS pin LOW)
  tft.startWrite(); 
  tft.setAddrWindow(area->x1, area->y1, w, h);

#ifdef ENABLE_TE_SYNC
  // 3. V-Sync(TE) 동기화 복구 (첫 번째 조각 전송 전에만 스캐너 대기)
  static bool wait_for_te = true;
  if (wait_for_te && te_semaphore != NULL) {
      xSemaphoreTake(te_semaphore, pdMS_TO_TICKS(100)); // TE 신호 한 사이클 대기
  }
  wait_for_te = lv_disp_flush_is_last(disp); // 마지막 조각을 보낼 때 다음 프레임을 위해 대기 락 설정
#endif

