zenes/esp32s3-TAS/examples/tas/tas.ino
  // --- Ethernet Panel ---
  lv_obj_t *eth_panel = lv_obj_create(panel_container);
  lv_obj_set_size(eth_panel, 140, 140);
  lv_obj_set_style_bg_color(eth_panel, lv_color_make(35, 40, 50), 0);
  lv_obj_set_style_border_color(eth_panel, lv_color_make(80, 80, 90), 0);
  lv_obj_set_style_border_width(eth_panel, 1, 0);
  lv_obj_set_layout(eth_panel, LV_LAYOUT_FLEX);
  lv_obj_set_flex_flow(eth_panel, LV_FLEX_FLOW_COLUMN);
  lv_obj_set_flex_align(eth_panel, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER);

  lv_obj_t *eth_title = lv_label_create(eth_panel);
  lv_label_set_text(eth_title, "Ethernet");
  lv_obj_set_style_text_color(eth_title, lv_palette_main(LV_PALETTE_CYAN), 0);
  lv_obj_set_style_text_font(eth_title, &lv_font_montserrat_14, 0);

  ui_label_eth = lv_label_create(eth_panel);
  lv_label_set_recolor(ui_label_eth, true);
  lv_label_set_text(ui_label_eth, "#FF0000 Offline#");
  lv_obj_set_style_text_align(ui_label_eth, LV_TEXT_ALIGN_CENTER, 0);

  // --- AP Panel ---
  lv_obj_t *ap_panel = lv_obj_create(panel_container);
  lv_obj_set_size(ap_panel, 140, 140);
  lv_obj_set_style_bg_color(ap_panel, lv_color_make(35, 40, 50), 0);
  lv_obj_set_style_border_color(ap_panel, lv_color_make(80, 80, 90), 0);
  lv_obj_set_style_border_width(ap_panel, 1, 0);
  lv_obj_set_layout(ap_panel, LV_LAYOUT_FLEX);
  lv_obj_set_flex_flow(ap_panel, LV_FLEX_FLOW_COLUMN);
  lv_obj_set_flex_align(ap_panel, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER, LV_FLEX_ALIGN_CENTER);

  lv_obj_t *ap_title = lv_label_create(ap_panel);
  lv_label_set_text(ap_title, "WiFi AP");
  lv_obj_set_style_text_color(ap_title, lv_palette_main(LV_PALETTE_YELLOW), 0);
  lv_obj_set_style_text_font(ap_title, &lv_font_montserrat_14, 0);

  ui_label_ap = lv_label_create(ap_panel);
  lv_label_set_recolor(ui_label_ap, true);
  lv_label_set_text(ui_label_ap, "#FF0000 Stop#");
  lv_obj_set_style_text_align(ui_label_ap, LV_TEXT_ALIGN_CENTER, 0);

  ui_label_clients = lv_label_create(ap_panel);
  lv_label_set_text(ui_label_clients, "Clients: 0");
  lv_obj_set_style_text_color(ui_label_clients, lv_palette_main(LV_PALETTE_GREY), 0);

#ifdef ENABLE_GRADIENT_BG
  /* Test Moving Rect & Gradient Animation Registration */
  ui_test_rect = lv_obj_create(scr);
  if (ui_test_rect) {
    lv_obj_set_size(ui_test_rect, 15, 15);
    lv_obj_set_style_bg_color(ui_test_rect, lv_palette_main(LV_PALETTE_YELLOW), 0);
    lv_obj_set_style_border_width(ui_test_rect, 0, 0); 
    lv_obj_align(ui_test_rect, LV_ALIGN_CENTER, 0, 50);
    
    // Create 60Hz timer (1000/16 = 62.5 FPS)
    lv_timer_create(move_test_rect_cb, 16, NULL);
  }
#endif
}

/**
 * @brief Update LCD with current network status (LVGL version)
 */
void updateLCD() {
#ifdef ENABLE_LCD
  if (!lcd_initialized) {
    return;
  }

  // Update Ethernet Status Label
  if (eth_connected) {
    char buf_eth[64];
    snprintf(buf_eth, sizeof(buf_eth), "#00FF00 Link Up#\n\n%s", ETH.localIP().toString().c_str());
    lv_label_set_text(ui_label_eth, buf_eth);
  } else {
    lv_label_set_text(ui_label_eth, "#FF0000 Offline#");
  }

  // Update AP Status Label
  if (ap_started) {
    char buf_ap[64];
    snprintf(buf_ap, sizeof(buf_ap), "#00FF00 Active#\n\n%s", ap_ssid_custom.c_str());
    lv_label_set_text(ui_label_ap, buf_ap);

    char buf_clients[32];
    snprintf(buf_clients, sizeof(buf_clients), "Clients: %d", WiFi.softAPgetStationNum());
    lv_label_set_text(ui_label_clients, buf_clients);
  } else {
    lv_label_set_text(ui_label_ap, "#FF0000 Stop#");
    lv_label_set_text(ui_label_clients, "Clients: 0");
  }
#endif
}

/**
 * @brief Handle Serial Shell Commands
 */
void handleShell() {
  while (Serial.available()) {
    char inChar = (char)Serial.read();

    // ANSI Escape Sequence Parser
    if (ansi_state == ANSI_NONE) {
      if (inChar == 0x1B) { // ESC
        ansi_state = ANSI_ESC;
        continue;
      }
    } else if (ansi_state == ANSI_ESC) {
      if (inChar == '[') {
        ansi_state = ANSI_BRACKET;
      } else {
        ansi_state = ANSI_NONE;
      }
      continue;
    } else if (ansi_state == ANSI_BRACKET) {
      ansi_state = ANSI_NONE;
      if (inChar == 'A') { // UP Arrow
        if (history_count > 0) {
          if (history_index == -1) history_index = history_count - 1;
          else if (history_index > 0) history_index--;
          
          inputString = shell_history[history_index];
          cursor_pos = inputString.length();
          refreshLine();
        }
        continue;
      }
      else if (inChar == 'B') { // DOWN Arrow
        if (history_count > 0 && history_index != -1) {
          history_index++;
          if (history_index >= history_count) {
            history_index = -1;
            inputString = "";
          } else {
            inputString = shell_history[history_index];
          }
          cursor_pos = inputString.length();
          refreshLine();
        }
        continue;
      }
      else if (inChar == 'C') { // RIGHT Arrow
        if (cursor_pos < inputString.length()) {
          cursor_pos++;
          Serial.print("\033[C"); // ANSI Right
        }
        continue;
      }
      else if (inChar == 'D') { // LEFT Arrow
        if (cursor_pos > 0) {
          cursor_pos--;
          Serial.print("\033[D"); // ANSI Left
        }
        continue;
      }
      continue;
    }
    
    // Ctrl+C (Cancel)
    if (inChar == 0x03) {
      if (ping_running) {
        ping_running = false;
        Serial.print("^C\r\nStopping ping.\r\n> ");
      } else {
        Serial.print("^C\r\n> ");
      }
      inputString = "";
      cursor_pos = 0;
      history_index = -1;
      tab_match_index = -1;
      tab_prefix = "";
      continue;
    }

    // Reset Tab Cycling if anything else is pressed
    if (inChar != 0x09) {
      tab_match_index = -1;
      tab_prefix = "";
    }

    // Echo back the character
    if (inChar == '\n' || inChar == '\r') {
      Serial.print("\r\n"); // New line on enter
      if (inputString.length() > 0) {
        // Save to history
        if (history_count == 0 || shell_history[history_count-1] != inputString) {
          if (history_count < MAX_HISTORY) {
            shell_history[history_count++] = inputString;
          } else {
            for (int i = 0; i < MAX_HISTORY - 1; i++) shell_history[i] = shell_history[i+1];
            shell_history[MAX_HISTORY-1] = inputString;
          }
        }
        history_index = -1;
        cursor_pos = 0; // Reset for next command
        stringComplete = true;
      } else {
        Serial.print("> "); // Empty line, just show prompt
        cursor_pos = 0;
      }
    } 
    else if (inChar == 0x09) { // Tab key
      if (inputString.length() > 0) {
        // First tab or cycling?
        if (tab_match_index == -1) {
          tab_prefix = inputString;
          tab_match_index = 0;
        } else {
          tab_match_index++;
        }

        String matches[shell_cmd_count];
        int matchCount = 0;
        for (int i = 0; i < shell_cmd_count; i++) {
          if (String(shell_commands[i]).startsWith(tab_prefix)) {
            matches[matchCount++] = shell_commands[i];
          }
        }

        if (matchCount > 0) {
          if (tab_match_index >= matchCount) tab_match_index = 0;
          
          inputString = matches[tab_match_index];
          cursor_pos = inputString.length();
          refreshLine();
        }
      }
    }
    else if (inChar == 0x08 || inChar == 0x7F) { // Backspace or Delete
      if (cursor_pos > 0) {
        inputString.remove(cursor_pos - 1, 1);
        cursor_pos--;
        refreshLine();
      }
    }
    else {
      // Insert character at cursor_pos
      if (cursor_pos == inputString.length()) {
        inputString += inChar;
        cursor_pos++;
        Serial.print(inChar); // Normal echo
      } else {
        String start = inputString.substring(0, cursor_pos);
        String end = inputString.substring(cursor_pos);
        inputString = start + inChar + end;
        cursor_pos++;
        refreshLine();
      }
    }
  }

  if (stringComplete) {
    inputString.trim();
    // Handled in handleShell loop already

